# Даны два списка одинаковой длины. Необходимо создать из них словарь таким образом,
# чтобы элементы первого списка были ключами, а элементы второго — соответственно значениями нашего словаря.

keys = ['name', 'surname', 'age', 'rate']
values = ['Петр', 'Первый', 42, 1300]

# TODO: your code here
# Нужно получить словарь:
# {'name': 'Петр', 'surname': 'Первый', 'age': 42, 'rate': 1300}
keys = ['name', 'surname', 'age', 'rate']
values = ['Петр', 'Первый', 42, 1300]
dic = {}
j = 0
for i in keys:
    dic[i] = values[j]
    j += 1
print(dic)
