# Дано 3 кортежа заполненные произвольными целыми числами.
# Найдите количество элементов, которые встречаются во всех трех кортежах.

# TODO: your code here
tup_1 = (-1, -9, -7, 2, 6, 9, -8, 8, 5, 8,)
tup_2 = (20, -14,-8, -6, 16, 13, -16, 13, 2, -9, 2,)
tup_3 = (-25, 9, -20, 28, -4, -13, -8, 11, 20, 3, -9)
summa = 0
for i in tup_1:
    if tup_2.count(i) > 0:
        if tup_3.count(i) > 0:
            summa += 1
print(summa)
