## "Дружественные числа"

### Задание

Два натуральных числа называются дружественными, если каждое из них равно сумме всех натуральных делителей другого
(само число при этом не рассматривается в качестве собственного делителя). \
Необходимо найти все пары натуральных дружественных чисел (не равных друг другу), до введенного числа.

### Формат входных данных

Дано одно целое положительное число

### Формат выходных данных

Вывести все пары дружественных чисел, удовлетворяющие условию задачи.

### Решение задачи
'''дружественные числа'''
import time
n = int(input('Input Number:'))
tic = time.perf_counter()
sum1, sum2 = 0, 0
m = n
i, j = 1, 1
f1, f2 = 0, 0
while m >= n * 0.001:  # коэффициент для уменьшения количества итераций 
    if m % i == 0:
        sum1 = sum1 + i
    if sum1 == 1 and i > 7:  # если число простое до 7 пропускаем
        i = 1
        sum1 = 0
        m = m - 1
        continue
    i += 1
    if (sum1 == f1 and m == f2) or (sum1 == f2 and m == f1):  # условие для вывода пары не более 1 раза
        continue
    if m * 0.75 < sum1 < m:  # 0.75 для уменьшения количества итераций, разница между числами не более 25%
        while j < sum1:
            if sum1 % j == 0:
                sum2 = sum2 + j
            if sum2 == 1 and j > 7:  # если число простые до 7 пропускаем
                break
            if sum2 == m and j >= m / 2:  # если сумма не всех (второе условие)! делителей
                f1 = sum1
                f2 = sum2
                toc1 = time.perf_counter()
                print(f1, ' дружит с ', f2, '  поиск занял ', (toc1 - tic) / 60, ' минут')
                break
            j += 1
        j = 1
        sum2 = 0
    if sum1 >= m:
        sum1 = 0
        i = 1
        m = m - 1
toc = time.perf_counter()
print('Весь поиск занял', (toc - tic) / 60, 'минут')
