## "Число Фибоначчи"

### Задание

По данному числу n определите n-е [число Фибоначчи](https://ru.wikipedia.org/wiki/%D0%A7%D0%B8%D1%81%D0%BB%D0%B0_%D0%A4%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8).

### Формат входных данных

Дано целое положительное число n, номер числа Фибоначчи в последовательности.

### Формат выходных данных

Вывести число Фибоначчи с номером n.


### Решение задачи
num_f = int(input('Input number:'))
fib = 0
i, j = 1, 0
while i < num_f:
    #print(i, ' ', fib, ' ', j)
    if 0 <= i <= 1:
        fib = j + i
    elif i <= 3:
        fib = j + fib
        j = 1
    else:
        fib = j + fib
        j = fib - j
    i += 1
print('для номера:', num_f, ' число Фибоначчи в последовательности будет: ', fib, ' c учетом 1-го члена 0')
