## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

a = int(input('Введите длину стороны квадрата 1 < a < 20 : '))
i = 0
j = 0
a = a - 1 # уменьшаем для приведения кол-ва итераций к нужному числу, т.к. счетчик с 0  
while i <= a:
    while j <= a:
        if i == j or i == a - j:
            print('#', end='')
        else:
            print(' ', end='')
        j += 1
    print()
    i += 1
    j = 0
