## "Все совершенные число в диапазоне"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Найдите все совершенные числа и их количество в заданном диапазоне [a, b].

### Формат входных данных

Даны два целых положительных числа, границы диапазона. Гарантируется, что a < b.

### Формат выходных данных

Вывести все совершенные числа, а затем их количество.

### Решение задачи

a = int(input('Input a:'))
b = int(input('Input b:'))
total = 0
while a <= b:
    summa = 0
    i = 1
    while i <= a:
        if a % i == 0 and i != a:
            summa += i
        i += 1
    if a == summa:
        total += summa
        print(a, end=' ')
    a += 1
print()
print(total)

<details>
<summary>Подсказка-2</summary>
Для проверки числа на совершенность, воспользуйтесь решение предыдущей задачи "Совершенное число".
</details>
