## "Бесконечный ввод и подсчет положительных"

### Задание

С клавиатуры вводятся целые числа, до тех пор пока не будет введена строка "стоп". \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Вводятся целые числа, пока не будет введено "стоп".

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

summa = 0
while True:
    sim = input('input numberes while стоп:')
    if sim.upper() == 'СТОП':
        break
    elif int(sim) > 0:
        summa += 1
print('Quantity of pozitive numberes:', summa)
