## "Совершенное число"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Проверить, является ли данное число совершенным.

### Формат входных данных

Дано целое положительно число.

### Формат выходных данных

Вывести "Да", если число совершенно и "Нет" в противоположном случае.

### Решение задачи
number = int(input('Input number:'))
summa = 0
i = 1
while i <= number:
    if number % i == 0 and i != number:
        summa += i
    i += 1
if number == summa:
    print('Да')
else:
    print('Нет')
