## "Делители числа"

### Задание

Найдите все делители заданного числа.

### Формат входных данных

Дано целое положительное число.

### Формат выходных данных

Вывести все делители данного числа, кроме единицы и самого числа. \
Если делителей(отличных от единицы и самого числа) нет, то вывести "Число простое"

### Решение задачи
number = int(input('Введите число:'))
i = 1
while i <= number:
    if number % i == 0 and i != 1 and i != number:
        print(i, end=' ')
        priznak = 1
    elif i == 1 and i != number:
        priznak = 0
    i += 1
if priznak == 0:
    print('Число простое')
