# Дан файл ("data/fruits.txt") со списком фруктов.
# Записать в новые файлы все фрукты, начинающиеся с определенной буквы.
# Т.е. в одном файле будут все фрукты на букву “А”, во втором на “Б” и т.д.
# Файлы назвать соответственно.
# Пример имен файлов: fruits_А.txt, fruits_Б.txt, fruits_В.txt ….
# Важно! Обратите внимание, что нет фруктов, начинающихся с некоторых букв,
#        а также есть пустые строки, которые нужно пропустить.
# Напишите универсальный код, который будет работать с любым списком фруктов и
# распределять по файлам в зависимости от первых букв, имеющихся в списке фруктов.

# Возможно пригодится:
# Чтобы получить список больших букв русского алфавита:
# print(list(map(chr, range(ord('А'), ord('Я')+1))))
ath = 'Data/fruits.txt'
f = open(path, 'r', encoding='UTF-8')
index = '!'
for line in f:
    if len(line.split()) > 0:
        l = line.split()[0]
        index = l[0].split()
        path = 'Data/fruits_' + str(index[0]) + '.txt'
        f_out = open(path, 'a', encoding='UTF-8')
        f_out.write(str(line))
